<?php

namespace Database\Seeders;

use App\Models\Brand;
use App\Models\Gallery;
use App\Models\Product;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProductTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('products')->insert([
            'id' => 1,
            'name' => "کرم مرطوب کننده قوی ویتامین E",
            'nickName' => 'MY Rich Hidrating Vitamine E',
            'price' => '41600',
            'UPC' => '1212123',
            'volume' => '20',
            'weight' => '20',
            'quantity' => '100',
            'maxOrder' =>'8',
            'abstract' =>'تامین و نگهداری رطوبت پوست در تمام طول روز- جلوگیری از خشکی و پیری پوست- برطرف کننده خشکی پوست- حافظ خاصیت الاستیی و تازگی پوست- مقابله با رادیکالهای آزاد- حاوی هیالورونیک اسید جهت حفظ و تنظیم رطوبت پوست',
            'description' => 'فرقی نمی‌کند پوست‌تان خشک، چرب یا ترکیبی از هر دو باشد چون مرطوب کننده‌ها روند فرسایش پوست را به تعویق می‌اندازند و از آن در برابر تغییرات ناگهانی آب‌وهوا محافظت می‌کنند. مرطوب‌کننده‌ها به اشکال مختلف لوسیون مایع، پماد و کرم دیده می‌شوند که میزان چربی و آب آن‌ها باهم تفاوت دارد و غلظت‌ آن‌ها در هر شکل متفاوت است. مهم‌ترین نکته در انتخاب یک مرطوب‌کننده، توجه به نوع پوست است که می‌تواند خشک، چرب، معمولی و مختلط باشد. برای اینکه نوع پوست‌تان را بشناسید کافی است پس از حمام کردن، روی پوست تمیز خود دست بکشید و متوجه میزان چربی روی آن شوید. برای پوست‌های خشک باید از مرطوب کننده‌های حاوی چربی استفاده کرد. در مورد پوست‌های چرب نیازی به استفاده از مرطوب‌کننده نیست، مگر در برخورد با آب‌وهوای گرم یا سرد. در مورد پوست نرمال باید از مرطوب‌کننده‌ای که میزان چربی کمتری داشته باشد، استفاده کرد. پزشکان متخصص پوست برای داشتن پوستی مرطوب و نرم بهترین زمان استفاده از کرم‌های مرطوب‌کننده را سه دقیقه بعد از حمام می‌دانند.',
            'gallery_id' => Gallery::whereFlag('Products')->first()->id,
            'brand_id' => Brand::find(1)->id,
            'user_id' => 1
        ]);
    }
}
